#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_start_ec2.data.archive_file.lambda_zip: Reading...
module.lambda_stop_ec2.data.archive_file.lambda_zip: Reading...
module.lambda_start_ec2.data.archive_file.lambda_zip: Read complete after 0s [id=a98906208fe156812833341305ef83a4e1ed7fef]
module.lambda_stop_ec2.data.archive_file.lambda_zip: Read complete after 0s [id=ea88f891e5a64006cff90bdde537708676f5b6ae]
module.lambda_stop_ec2.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::199570228070:policy/ec2-scheduler-stop-ec2-instances-policy]
module.lambda_stop_ec2.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/ec2-scheduler-stop-ec2-instances]
module.lambda_start_ec2.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::199570228070:policy/ec2-scheduler-start-ec2-instances-policy]
module.lambda_start_ec2.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/ec2-scheduler-start-ec2-instances]
module.lambda_start_ec2.aws_iam_role.lambda_role: Refreshing state... [id=ec2-scheduler-start-ec2-instances-role]
module.lambda_stop_ec2.aws_iam_role.lambda_role: Refreshing state... [id=ec2-scheduler-stop-ec2-instances-role]
module.lambda_start_ec2.aws_lambda_function.function: Refreshing state... [id=ec2-scheduler-start-ec2-instances]
module.lambda_stop_ec2.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=ec2-scheduler-stop-ec2-instances-role-20250606090618766600000002]
module.lambda_stop_ec2.aws_lambda_function.function: Refreshing state... [id=ec2-scheduler-stop-ec2-instances]
module.lambda_start_ec2.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=ec2-scheduler-start-ec2-instances-role-20250606090618761400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudwatch_start_schedule.aws_cloudwatch_event_rule.schedule will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Triggers the Lambda function to start EC2 instances at 8:00 AM on weekdays"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ec2-scheduler-start-instances-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 ? * MON-FRI *)"
      + tags                = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all            = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.cloudwatch_start_schedule.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = "arn:aws:lambda:ap-south-1:199570228070:function:ec2-scheduler-start-ec2-instances"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "ec2-scheduler-start-instances-schedule"
      + target_id      = "InvokeLambda"
    }

  # module.cloudwatch_start_schedule.aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ec2-scheduler-start-ec2-instances"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudwatch_stop_schedule.aws_cloudwatch_event_rule.schedule will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Triggers the Lambda function to stop EC2 instances at 5:00 PM on weekdays"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ec2-scheduler-stop-instances-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 17 ? * MON-FRI *)"
      + tags                = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all            = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.cloudwatch_stop_schedule.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = "arn:aws:lambda:ap-south-1:199570228070:function:ec2-scheduler-stop-ec2-instances"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "ec2-scheduler-stop-instances-schedule"
      + target_id      = "InvokeLambda"
    }

  # module.cloudwatch_stop_schedule.aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ec2-scheduler-stop-ec2-instances"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_start_rule_arn      = (known after apply)
  + cloudwatch_stop_rule_arn       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @nag9844, Action: `pull_request`*